{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_1", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(7,7)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(3,3)", 
        "stride": "(2,2)", 
        "workspace": "1024"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_1", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool_1", 
      "attr": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2,2)"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_2_red_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_2_red_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_2_red", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_2_red_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2_red_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2_red_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2_red_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_2_red", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_2_red", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_2", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "192", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_2", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool_2", 
      "attr": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2,2)"
      }, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3a_1x1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_1x1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3a_1x1", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[29, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3a_1x1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_1x1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_1x1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_1x1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3a_1x1", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0], [35, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3a_1x1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3a_3x3_reduce_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_3x3_reduce_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3a_3x3_reduce", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[29, 0, 0], [39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3a_3x3_reduce_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_3x3_reduce_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_3x3_reduce_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_3x3_reduce_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3a_3x3_reduce", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0], [44, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3a_3x3_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3a_3x3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_3x3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3a_3x3", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[47, 0, 0], [48, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3a_3x3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_3x3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_3x3_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_3x3_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3a_3x3", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[50, 0, 0], [51, 0, 0], [52, 0, 0], [53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3a_3x3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_reduce_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_reduce_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3a_double_3x3_reduce", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[29, 0, 0], [57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_reduce_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_reduce_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_reduce_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_reduce_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3a_double_3x3_reduce", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[59, 0, 0], [60, 0, 0], [61, 0, 0], [62, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3a_double_3x3_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_0_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_0_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3a_double_3x3_0", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[65, 0, 0], [66, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_0_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_0_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3a_double_3x3_0", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[68, 0, 0], [69, 0, 0], [70, 0, 0], [71, 0, 0], [72, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3a_double_3x3_0", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3a_double_3x3_1", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3a_double_3x3_1", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[77, 0, 0], [78, 0, 0], [79, 0, 0], [80, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3a_double_3x3_1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "avg_pool_3a_pool", 
      "attr": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(1,1)", 
        "pool_type": "avg", 
        "pooling_convention": "valid", 
        "stride": "(1,1)"
      }, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3a_proj_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_proj_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3a_proj", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3a_proj_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_proj_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_proj_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_proj_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3a_proj", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[87, 0, 0], [88, 0, 0], [89, 0, 0], [90, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3a_proj", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ch_concat_3a_chconcat", 
      "attr": {
        "dim": "1", 
        "num_args": "4"
      }, 
      "inputs": [[38, 0, 0], [56, 0, 0], [83, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3b_1x1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_1x1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3b_1x1", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[94, 0, 0], [95, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3b_1x1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_1x1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_1x1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_1x1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3b_1x1", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[97, 0, 0], [98, 0, 0], [99, 0, 0], [100, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3b_1x1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3b_3x3_reduce_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_3x3_reduce_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3b_3x3_reduce", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[94, 0, 0], [104, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3b_3x3_reduce_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_3x3_reduce_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_3x3_reduce_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_3x3_reduce_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3b_3x3_reduce", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[106, 0, 0], [107, 0, 0], [108, 0, 0], [109, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3b_3x3_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3b_3x3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_3x3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3b_3x3", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3b_3x3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_3x3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_3x3_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_3x3_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3b_3x3", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[115, 0, 0], [116, 0, 0], [117, 0, 0], [118, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3b_3x3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3b_double_3x3_reduce_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_double_3x3_reduce_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3b_double_3x3_reduce", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[94, 0, 0], [122, 0, 0], [123, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3b_double_3x3_reduce_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_double_3x3_reduce_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_double_3x3_reduce_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_double_3x3_reduce_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3b_double_3x3_reduce", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[124, 0, 0], [125, 0, 0], [126, 0, 0], [127, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3b_double_3x3_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3b_double_3x3_0_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_double_3x3_0_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3b_double_3x3_0", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[130, 0, 0], [131, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3b_double_3x3_0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_double_3x3_0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_double_3x3_0_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_double_3x3_0_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3b_double_3x3_0", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[133, 0, 0], [134, 0, 0], [135, 0, 0], [136, 0, 0], [137, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3b_double_3x3_0", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[138, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3b_double_3x3_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_double_3x3_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3b_double_3x3_1", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[139, 0, 0], [140, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3b_double_3x3_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_double_3x3_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_double_3x3_1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_double_3x3_1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3b_double_3x3_1", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[142, 0, 0], [143, 0, 0], [144, 0, 0], [145, 0, 0], [146, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3b_double_3x3_1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "avg_pool_3b_pool", 
      "attr": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(1,1)", 
        "pool_type": "avg", 
        "pooling_convention": "valid", 
        "stride": "(1,1)"
      }, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3b_proj_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_proj_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3b_proj", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[149, 0, 0], [150, 0, 0], [151, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3b_proj_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_proj_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_proj_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_proj_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3b_proj", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[152, 0, 0], [153, 0, 0], [154, 0, 0], [155, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3b_proj", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ch_concat_3b_chconcat", 
      "attr": {
        "dim": "1", 
        "num_args": "4"
      }, 
      "inputs": [[103, 0, 0], [121, 0, 0], [148, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3c_3x3_reduce_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3c_3x3_reduce_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3c_3x3_reduce", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[159, 0, 0], [160, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3c_3x3_reduce_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3c_3x3_reduce_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3c_3x3_reduce_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3c_3x3_reduce_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3c_3x3_reduce", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[162, 0, 0], [163, 0, 0], [164, 0, 0], [165, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3c_3x3_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3c_3x3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3c_3x3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3c_3x3", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(2,2)", 
        "workspace": "1024"
      }, 
      "inputs": [[168, 0, 0], [169, 0, 0], [170, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3c_3x3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3c_3x3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3c_3x3_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3c_3x3_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3c_3x3", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[171, 0, 0], [172, 0, 0], [173, 0, 0], [174, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3c_3x3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3c_double_3x3_reduce_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3c_double_3x3_reduce_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3c_double_3x3_reduce", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[159, 0, 0], [178, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3c_double_3x3_reduce_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3c_double_3x3_reduce_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3c_double_3x3_reduce_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3c_double_3x3_reduce_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3c_double_3x3_reduce", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[180, 0, 0], [181, 0, 0], [182, 0, 0], [183, 0, 0], [184, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3c_double_3x3_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3c_double_3x3_0_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3c_double_3x3_0_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3c_double_3x3_0", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[186, 0, 0], [187, 0, 0], [188, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3c_double_3x3_0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3c_double_3x3_0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3c_double_3x3_0_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3c_double_3x3_0_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3c_double_3x3_0", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[189, 0, 0], [190, 0, 0], [191, 0, 0], [192, 0, 0], [193, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3c_double_3x3_0", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3c_double_3x3_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3c_double_3x3_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3c_double_3x3_1", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(2,2)", 
        "workspace": "1024"
      }, 
      "inputs": [[195, 0, 0], [196, 0, 0], [197, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3c_double_3x3_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3c_double_3x3_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3c_double_3x3_1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3c_double_3x3_1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3c_double_3x3_1", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[198, 0, 0], [199, 0, 0], [200, 0, 0], [201, 0, 0], [202, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3c_double_3x3_1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "max_pool_3c_pool", 
      "attr": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(1,1)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2,2)"
      }, 
      "inputs": [[159, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ch_concat_3c_chconcat", 
      "attr": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[177, 0, 0], [204, 0, 0], [205, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_4a_1x1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_4a_1x1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_4a_1x1", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "224", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[206, 0, 0], [207, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_4a_1x1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_4a_1x1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_4a_1x1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_4a_1x1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_4a_1x1", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[209, 0, 0], [210, 0, 0], [211, 0, 0], [212, 0, 0], [213, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_4a_1x1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[214, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_4a_3x3_reduce_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_4a_3x3_reduce_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_4a_3x3_reduce", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[206, 0, 0], [216, 0, 0], [217, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_4a_3x3_reduce_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_4a_3x3_reduce_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_4a_3x3_reduce_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_4a_3x3_reduce_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_4a_3x3_reduce", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[218, 0, 0], [219, 0, 0], [220, 0, 0], [221, 0, 0], [222, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_4a_3x3_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[223, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_4a_3x3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_4a_3x3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_4a_3x3", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[224, 0, 0], [225, 0, 0], [226, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_4a_3x3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_4a_3x3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_4a_3x3_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_4a_3x3_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_4a_3x3", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[227, 0, 0], [228, 0, 0], [229, 0, 0], [230, 0, 0], [231, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_4a_3x3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[232, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_4a_double_3x3_reduce_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_4a_double_3x3_reduce_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_4a_double_3x3_reduce", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[206, 0, 0], [234, 0, 0], [235, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_4a_double_3x3_reduce_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_4a_double_3x3_reduce_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_4a_double_3x3_reduce_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_4a_double_3x3_reduce_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_4a_double_3x3_reduce", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[236, 0, 0], [237, 0, 0], [238, 0, 0], [239, 0, 0], [240, 0, 0]]
    }, 
    {
      "op": "Activation", 
